###################################################################

# Created by write_sdc on Thu Feb 27 16:10:52 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
create_clock [get_ports clk_in]  -name clk  -period 5  -waveform {0 2.5}
set_load -max 30.1911  [get_nets {load_size_in[1]}]
set_load -min 27.8387  [get_nets {load_size_in[1]}]
set_resistance 0.000251806  [get_nets {load_size_in[1]}]
set_load -max 5.43273  [get_nets {load_size_in[0]}]
set_load -min 5.01085  [get_nets {load_size_in[0]}]
set_resistance 9.52651e-05  [get_nets {load_size_in[0]}]
set_load -max 2.92398  [get_nets load_unsigned_in]
set_load -min 2.69593  [get_nets load_unsigned_in]
set_resistance 5.20902e-05  [get_nets load_unsigned_in]
set_load -max 2.36513  [get_nets {data_in[31]}]
set_load -min 2.18174  [get_nets {data_in[31]}]
set_resistance 4.98238e-05  [get_nets {data_in[31]}]
set_load -max 2.53142  [get_nets {data_in[30]}]
set_load -min 2.33456  [get_nets {data_in[30]}]
set_resistance 4.92034e-05  [get_nets {data_in[30]}]
set_load -max 3.59208  [get_nets {data_in[29]}]
set_load -min 3.31316  [get_nets {data_in[29]}]
set_resistance 7.28212e-05  [get_nets {data_in[29]}]
set_load -max 3.64372  [get_nets {data_in[28]}]
set_load -min 3.35989  [get_nets {data_in[28]}]
set_resistance 6.74552e-05  [get_nets {data_in[28]}]
set_load -max 5.01572  [get_nets {data_in[27]}]
set_load -min 4.62506  [get_nets {data_in[27]}]
set_resistance 9.31601e-05  [get_nets {data_in[27]}]
set_load -max 5.51481  [get_nets {data_in[26]}]
set_load -min 5.08571  [get_nets {data_in[26]}]
set_resistance 0.000105564  [get_nets {data_in[26]}]
set_load -max 3.88845  [get_nets {data_in[25]}]
set_load -min 3.58676  [get_nets {data_in[25]}]
set_resistance 8.06031e-05  [get_nets {data_in[25]}]
set_load -max 5.33304  [get_nets {data_in[24]}]
set_load -min 4.91747  [get_nets {data_in[24]}]
set_resistance 9.77047e-05  [get_nets {data_in[24]}]
set_load -max 2.80976  [get_nets {data_in[23]}]
set_load -min 2.59126  [get_nets {data_in[23]}]
set_resistance 5.46076e-05  [get_nets {data_in[23]}]
set_load -max 4.43838  [get_nets {data_in[22]}]
set_load -min 4.09312  [get_nets {data_in[22]}]
set_resistance 8.55252e-05  [get_nets {data_in[22]}]
set_load -max 7.20283  [get_nets {data_in[21]}]
set_load -min 6.64212  [get_nets {data_in[21]}]
set_resistance 0.000135897  [get_nets {data_in[21]}]
set_load -max 5.01617  [get_nets {data_in[20]}]
set_load -min 4.6258  [get_nets {data_in[20]}]
set_resistance 9.54877e-05  [get_nets {data_in[20]}]
set_load -max 5.3452  [get_nets {data_in[19]}]
set_load -min 4.92887  [get_nets {data_in[19]}]
set_resistance 9.92357e-05  [get_nets {data_in[19]}]
set_load -max 6.62305  [get_nets {data_in[18]}]
set_load -min 6.10806  [get_nets {data_in[18]}]
set_resistance 0.000129182  [get_nets {data_in[18]}]
set_load -max 5.59455  [get_nets {data_in[17]}]
set_load -min 5.15924  [get_nets {data_in[17]}]
set_resistance 0.000107055  [get_nets {data_in[17]}]
set_load -max 4.17614  [get_nets {data_in[16]}]
set_load -min 3.85175  [get_nets {data_in[16]}]
set_resistance 8.38926e-05  [get_nets {data_in[16]}]
set_load -max 2.34722  [get_nets {data_in[15]}]
set_load -min 2.16521  [get_nets {data_in[15]}]
set_resistance 4.93927e-05  [get_nets {data_in[15]}]
set_load -max 2.38687  [get_nets {data_in[14]}]
set_load -min 2.20178  [get_nets {data_in[14]}]
set_resistance 5.01677e-05  [get_nets {data_in[14]}]
set_load -max 3.26344  [get_nets {data_in[13]}]
set_load -min 3.01018  [get_nets {data_in[13]}]
set_resistance 6.71968e-05  [get_nets {data_in[13]}]
set_load -max 3.2905  [get_nets {data_in[12]}]
set_load -min 3.03448  [get_nets {data_in[12]}]
set_resistance 6.30292e-05  [get_nets {data_in[12]}]
set_load -max 2.67473  [get_nets {data_in[11]}]
set_load -min 2.46699  [get_nets {data_in[11]}]
set_resistance 5.39022e-05  [get_nets {data_in[11]}]
set_load -max 5.05071  [get_nets {data_in[10]}]
set_load -min 4.6579  [get_nets {data_in[10]}]
set_resistance 9.79394e-05  [get_nets {data_in[10]}]
set_load -max 4.29416  [get_nets {data_in[9]}]
set_load -min 3.96095  [get_nets {data_in[9]}]
set_resistance 8.87154e-05  [get_nets {data_in[9]}]
set_load -max 3.27396  [get_nets {data_in[8]}]
set_load -min 3.01985  [get_nets {data_in[8]}]
set_resistance 6.71526e-05  [get_nets {data_in[8]}]
set_load -max 2.83582  [get_nets {data_in[7]}]
set_load -min 2.6153  [get_nets {data_in[7]}]
set_resistance 5.51749e-05  [get_nets {data_in[7]}]
set_load -max 2.7807  [get_nets {data_in[6]}]
set_load -min 2.56496  [get_nets {data_in[6]}]
set_resistance 5.76509e-05  [get_nets {data_in[6]}]
set_load -max 3.5781  [get_nets {data_in[5]}]
set_load -min 3.30067  [get_nets {data_in[5]}]
set_resistance 7.54838e-05  [get_nets {data_in[5]}]
set_load -max 2.47234  [get_nets {data_in[4]}]
set_load -min 2.28078  [get_nets {data_in[4]}]
set_resistance 5.31402e-05  [get_nets {data_in[4]}]
set_load -max 2.1303  [get_nets {data_in[3]}]
set_load -min 1.96523  [get_nets {data_in[3]}]
set_resistance 4.56721e-05  [get_nets {data_in[3]}]
set_load -max 2.99628  [get_nets {data_in[2]}]
set_load -min 2.76405  [get_nets {data_in[2]}]
set_resistance 6.38489e-05  [get_nets {data_in[2]}]
set_load -max 3.23143  [get_nets {data_in[1]}]
set_load -min 2.98082  [get_nets {data_in[1]}]
set_resistance 6.77276e-05  [get_nets {data_in[1]}]
set_load -max 2.29665  [get_nets {data_in[0]}]
set_load -min 2.11857  [get_nets {data_in[0]}]
set_resistance 4.84106e-05  [get_nets {data_in[0]}]
set_load -max 11.4936  [get_nets {iadder_1_to_0_in[1]}]
set_load -min 10.6004  [get_nets {iadder_1_to_0_in[1]}]
set_resistance 0.000147909  [get_nets {iadder_1_to_0_in[1]}]
set_load -max 3.53022  [get_nets {iadder_1_to_0_in[0]}]
set_load -min 3.25478  [get_nets {iadder_1_to_0_in[0]}]
set_resistance 6.20999e-05  [get_nets {iadder_1_to_0_in[0]}]
set_load -max 2.43606  [get_nets ahb_resp_in]
set_load -min 2.24596  [get_nets ahb_resp_in]
set_resistance 4.26009e-05  [get_nets ahb_resp_in]
set_load -max 0.553503  [get_nets {lu_output[31]}]
set_load -min 0.510505  [get_nets {lu_output[31]}]
set_resistance 1.10916e-05  [get_nets {lu_output[31]}]
set_load -max 0.780293  [get_nets {lu_output[30]}]
set_load -min 0.719613  [get_nets {lu_output[30]}]
set_resistance 1.51747e-05  [get_nets {lu_output[30]}]
set_load -max 1.83965  [get_nets {lu_output[29]}]
set_load -min 1.69698  [get_nets {lu_output[29]}]
set_resistance 3.85971e-05  [get_nets {lu_output[29]}]
set_load -max 0.657918  [get_nets {lu_output[28]}]
set_load -min 0.60681  [get_nets {lu_output[28]}]
set_resistance 1.31871e-05  [get_nets {lu_output[28]}]
set_load -max 0.711626  [get_nets {lu_output[27]}]
set_load -min 0.656228  [get_nets {lu_output[27]}]
set_resistance 1.34222e-05  [get_nets {lu_output[27]}]
set_load -max 1.48734  [get_nets {lu_output[26]}]
set_load -min 1.37147  [get_nets {lu_output[26]}]
set_resistance 2.7405e-05  [get_nets {lu_output[26]}]
set_load -max 1.27423  [get_nets {lu_output[25]}]
set_load -min 1.17492  [get_nets {lu_output[25]}]
set_resistance 2.32027e-05  [get_nets {lu_output[25]}]
set_load -max 1.26183  [get_nets {lu_output[24]}]
set_load -min 1.16373  [get_nets {lu_output[24]}]
set_resistance 2.47134e-05  [get_nets {lu_output[24]}]
set_load -max 1.85388  [get_nets {lu_output[23]}]
set_load -min 1.71004  [get_nets {lu_output[23]}]
set_resistance 3.83777e-05  [get_nets {lu_output[23]}]
set_load -max 3.22889  [get_nets {lu_output[22]}]
set_load -min 2.97795  [get_nets {lu_output[22]}]
set_resistance 6.38641e-05  [get_nets {lu_output[22]}]
set_load -max 0.863111  [get_nets {lu_output[21]}]
set_load -min 0.79603  [get_nets {lu_output[21]}]
set_resistance 1.70621e-05  [get_nets {lu_output[21]}]
set_load -max 1.38361  [get_nets {lu_output[20]}]
set_load -min 1.27579  [get_nets {lu_output[20]}]
set_resistance 2.5338e-05  [get_nets {lu_output[20]}]
set_load -max 0.817116  [get_nets {lu_output[19]}]
set_load -min 0.753593  [get_nets {lu_output[19]}]
set_resistance 1.60293e-05  [get_nets {lu_output[19]}]
set_load -max 0.818642  [get_nets {lu_output[18]}]
set_load -min 0.754924  [get_nets {lu_output[18]}]
set_resistance 1.55149e-05  [get_nets {lu_output[18]}]
set_load -max 1.17754  [get_nets {lu_output[17]}]
set_load -min 1.08573  [get_nets {lu_output[17]}]
set_resistance 2.11901e-05  [get_nets {lu_output[17]}]
set_load -max 0.695731  [get_nets {lu_output[16]}]
set_load -min 0.641435  [get_nets {lu_output[16]}]
set_resistance 1.21508e-05  [get_nets {lu_output[16]}]
set_load -max 0.677632  [get_nets {lu_output[15]}]
set_load -min 0.624962  [get_nets {lu_output[15]}]
set_resistance 1.33657e-05  [get_nets {lu_output[15]}]
set_load -max 0.794242  [get_nets {lu_output[14]}]
set_load -min 0.732527  [get_nets {lu_output[14]}]
set_resistance 1.58036e-05  [get_nets {lu_output[14]}]
set_load -max 1.37793  [get_nets {lu_output[13]}]
set_load -min 1.27081  [get_nets {lu_output[13]}]
set_resistance 2.70662e-05  [get_nets {lu_output[13]}]
set_load -max 0.955505  [get_nets {lu_output[12]}]
set_load -min 0.88119  [get_nets {lu_output[12]}]
set_resistance 1.85145e-05  [get_nets {lu_output[12]}]
set_load -max 0.620683  [get_nets {lu_output[11]}]
set_load -min 0.572536  [get_nets {lu_output[11]}]
set_resistance 1.29337e-05  [get_nets {lu_output[11]}]
set_load -max 1.17861  [get_nets {lu_output[10]}]
set_load -min 1.08696  [get_nets {lu_output[10]}]
set_resistance 2.29494e-05  [get_nets {lu_output[10]}]
set_load -max 0.787793  [get_nets {lu_output[9]}]
set_load -min 0.726568  [get_nets {lu_output[9]}]
set_resistance 1.55979e-05  [get_nets {lu_output[9]}]
set_load -max 0.971483  [get_nets {lu_output[8]}]
set_load -min 0.895595  [get_nets {lu_output[8]}]
set_resistance 1.64546e-05  [get_nets {lu_output[8]}]
set_load -max 0.619779  [get_nets {lu_output[7]}]
set_load -min 0.571573  [get_nets {lu_output[7]}]
set_resistance 1.19939e-05  [get_nets {lu_output[7]}]
set_load -max 1.6244  [get_nets {lu_output[6]}]
set_load -min 1.49803  [get_nets {lu_output[6]}]
set_resistance 3.12582e-05  [get_nets {lu_output[6]}]
set_load -max 3.96199  [get_nets {lu_output[5]}]
set_load -min 3.65293  [get_nets {lu_output[5]}]
set_resistance 7.01644e-05  [get_nets {lu_output[5]}]
set_load -max 0.757689  [get_nets {lu_output[4]}]
set_load -min 0.698903  [get_nets {lu_output[4]}]
set_resistance 1.57047e-05  [get_nets {lu_output[4]}]
set_load -max 0.978942  [get_nets {lu_output[3]}]
set_load -min 0.902867  [get_nets {lu_output[3]}]
set_resistance 1.94153e-05  [get_nets {lu_output[3]}]
set_load -max 1.63232  [get_nets {lu_output[2]}]
set_load -min 1.50517  [get_nets {lu_output[2]}]
set_resistance 3.02228e-05  [get_nets {lu_output[2]}]
set_load -max 2.8644  [get_nets {lu_output[1]}]
set_load -min 2.64106  [get_nets {lu_output[1]}]
set_resistance 5.14746e-05  [get_nets {lu_output[1]}]
set_load -max 1.35507  [get_nets {lu_output[0]}]
set_load -min 1.24947  [get_nets {lu_output[0]}]
set_resistance 2.47451e-05  [get_nets {lu_output[0]}]
set_load -max 1.64846  [get_nets N21]
set_load -min 1.52075  [get_nets N21]
set_resistance 3.54545e-05  [get_nets N21]
set_load -max 2.85764  [get_nets N22]
set_load -min 2.63446  [get_nets N22]
set_resistance 4.87044e-05  [get_nets N22]
set_load -max 4.04994  [get_nets N23]
set_load -min 3.73371  [get_nets N23]
set_resistance 6.95445e-05  [get_nets N23]
set_load -max 2.47918  [get_nets N24]
set_load -min 2.28642  [get_nets N24]
set_resistance 4.84747e-05  [get_nets N24]
set_load -max 2.38709  [get_nets N25]
set_load -min 2.20177  [get_nets N25]
set_resistance 4.86995e-05  [get_nets N25]
set_load -max 0.984486  [get_nets N26]
set_load -min 0.907637  [get_nets N26]
set_resistance 1.70619e-05  [get_nets N26]
set_load -max 4.62276  [get_nets N27]
set_load -min 4.26249  [get_nets N27]
set_resistance 8.4304e-05  [get_nets N27]
set_load -max 1.56051  [get_nets N28]
set_load -min 1.439  [get_nets N28]
set_resistance 2.92214e-05  [get_nets N28]
set_load -max 2.32349  [get_nets N29]
set_load -min 2.14231  [get_nets N29]
set_resistance 4.16003e-05  [get_nets N29]
set_load -max 1.72003  [get_nets N30]
set_load -min 1.58573  [get_nets N30]
set_resistance 2.95515e-05  [get_nets N30]
set_load -max 2.75479  [get_nets N31]
set_load -min 2.5404  [get_nets N31]
set_resistance 5.23862e-05  [get_nets N31]
set_load -max 2.35657  [get_nets N32]
set_load -min 2.17284  [get_nets N32]
set_resistance 4.24361e-05  [get_nets N32]
set_load -max 1.55187  [get_nets N33]
set_load -min 1.43143  [get_nets N33]
set_resistance 3.19e-05  [get_nets N33]
set_load -max 1.32978  [get_nets N34]
set_load -min 1.2263  [get_nets N34]
set_resistance 2.53695e-05  [get_nets N34]
set_load -max 2.21696  [get_nets N35]
set_load -min 2.04425  [get_nets N35]
set_resistance 4.08995e-05  [get_nets N35]
set_load -max 3.22506  [get_nets N36]
set_load -min 2.9738  [get_nets N36]
set_resistance 5.94453e-05  [get_nets N36]
set_load -max 1.97639  [get_nets N37]
set_load -min 1.82215  [get_nets N37]
set_resistance 3.4519e-05  [get_nets N37]
set_load -max 1.99412  [get_nets N38]
set_load -min 1.83851  [get_nets N38]
set_resistance 3.49736e-05  [get_nets N38]
set_load -max 3.51074  [get_nets N39]
set_load -min 3.23725  [get_nets N39]
set_resistance 6.48521e-05  [get_nets N39]
set_load -max 0.989623  [get_nets N40]
set_load -min 0.912933  [get_nets N40]
set_resistance 2.1168e-05  [get_nets N40]
set_load -max 1.36552  [get_nets N41]
set_load -min 1.259  [get_nets N41]
set_resistance 2.42054e-05  [get_nets N41]
set_load -max 2.12225  [get_nets N42]
set_load -min 1.95663  [get_nets N42]
set_resistance 3.7123e-05  [get_nets N42]
set_load -max 1.91108  [get_nets N43]
set_load -min 1.76176  [get_nets N43]
set_resistance 3.20629e-05  [get_nets N43]
set_load -max 1.37954  [get_nets N44]
set_load -min 1.27186  [get_nets N44]
set_resistance 2.39631e-05  [get_nets N44]
set_load -max 1.89801  [get_nets N45]
set_load -min 1.74996  [get_nets N45]
set_resistance 3.36866e-05  [get_nets N45]
set_load -max 2.14682  [get_nets N46]
set_load -min 1.97971  [get_nets N46]
set_resistance 4.06324e-05  [get_nets N46]
set_load -max 2.34139  [get_nets N47]
set_load -min 2.15934  [get_nets N47]
set_resistance 4.57374e-05  [get_nets N47]
set_load -max 1.73065  [get_nets N48]
set_load -min 1.59563  [get_nets N48]
set_resistance 3.05598e-05  [get_nets N48]
set_load -max 1.2485  [get_nets N49]
set_load -min 1.15141  [get_nets N49]
set_resistance 2.42414e-05  [get_nets N49]
set_load -max 1.63207  [get_nets N50]
set_load -min 1.50481  [get_nets N50]
set_resistance 2.92766e-05  [get_nets N50]
set_load -max 0.594796  [get_nets N51]
set_load -min 0.548698  [get_nets N51]
set_resistance 1.26908e-05  [get_nets N51]
set_load -max 0.893921  [get_nets N52]
set_load -min 0.824477  [get_nets N52]
set_resistance 1.79005e-05  [get_nets N52]
set_load -max 0.183281  [get_nets n45]
set_load -min 0.169013  [get_nets n45]
set_resistance 3.45488e-06  [get_nets n45]
set_load -max 2.34184  [get_nets n46]
set_load -min 2.16011  [get_nets n46]
set_resistance 4.83076e-05  [get_nets n46]
set_load -max 0.866565  [get_nets n47]
set_load -min 0.79908  [get_nets n47]
set_resistance 1.61614e-05  [get_nets n47]
set_load -max 7.13063  [get_nets n49]
set_load -min 6.57408  [get_nets n49]
set_resistance 0.000124069  [get_nets n49]
set_load -max 4.21281  [get_nets n50]
set_load -min 3.88482  [get_nets n50]
set_resistance 7.92329e-05  [get_nets n50]
set_load -max 0.307878  [get_nets n51]
set_load -min 0.283935  [get_nets n51]
set_resistance 5.97988e-06  [get_nets n51]
set_load -max 2.92352  [get_nets n52]
set_load -min 2.69523  [get_nets n52]
set_resistance 5.01039e-05  [get_nets n52]
set_load -max 0.58831  [get_nets n53]
set_load -min 0.542696  [get_nets n53]
set_resistance 1.2417e-05  [get_nets n53]
set_load -max 1.45463  [get_nets n54]
set_load -min 1.34102  [get_nets n54]
set_resistance 2.47623e-05  [get_nets n54]
set_load -max 0.776264  [get_nets n55]
set_load -min 0.715798  [get_nets n55]
set_resistance 1.43809e-05  [get_nets n55]
set_load -max 1.5377  [get_nets n56]
set_load -min 1.41773  [get_nets n56]
set_resistance 2.71104e-05  [get_nets n56]
set_load -max 1.94323  [get_nets n57]
set_load -min 1.79187  [get_nets n57]
set_resistance 3.60143e-05  [get_nets n57]
set_load -max 12.4153  [get_nets n58]
set_load -min 11.4488  [get_nets n58]
set_resistance 0.000163015  [get_nets n58]
set_load -max 4.16923  [get_nets n59]
set_load -min 3.84389  [get_nets n59]
set_resistance 7.31164e-05  [get_nets n59]
set_load -max 3.40134  [get_nets n60]
set_load -min 3.13635  [get_nets n60]
set_resistance 6.26673e-05  [get_nets n60]
set_load -max 1.26772  [get_nets n62]
set_load -min 1.16896  [get_nets n62]
set_resistance 2.33719e-05  [get_nets n62]
set_load -max 3.28741  [get_nets n63]
set_load -min 3.03165  [get_nets n63]
set_resistance 6.31119e-05  [get_nets n63]
set_load -max 11.6135  [get_nets n66]
set_load -min 10.7102  [get_nets n66]
set_resistance 0.000150877  [get_nets n66]
set_load -max 3.61624  [get_nets n67]
set_load -min 3.33421  [get_nets n67]
set_resistance 5.95978e-05  [get_nets n67]
set_load -max 2.1586  [get_nets n68]
set_load -min 1.9905  [get_nets n68]
set_resistance 4.0327e-05  [get_nets n68]
set_load -max 1.65841  [get_nets n69]
set_load -min 1.52965  [get_nets n69]
set_resistance 3.37153e-05  [get_nets n69]
set_load -max 4.50446  [get_nets n70]
set_load -min 4.15441  [get_nets n70]
set_resistance 8.93058e-05  [get_nets n70]
set_load -max 1.4443  [get_nets n71]
set_load -min 1.33187  [get_nets n71]
set_resistance 2.72712e-05  [get_nets n71]
set_load -max 2.95996  [get_nets n72]
set_load -min 2.72915  [get_nets n72]
set_resistance 5.30992e-05  [get_nets n72]
set_load -max 3.40403  [get_nets n73]
set_load -min 3.13876  [get_nets n73]
set_resistance 6.22045e-05  [get_nets n73]
set_load -max 6.1183  [get_nets n74]
set_load -min 5.64248  [get_nets n74]
set_resistance 8.87316e-05  [get_nets n74]
set_load -max 7.39045  [get_nets n75]
set_load -min 6.81521  [get_nets n75]
set_resistance 0.000104617  [get_nets n75]
set_load -max 9.15869  [get_nets n76]
set_load -min 8.44538  [get_nets n76]
set_resistance 0.000121743  [get_nets n76]
set_load -max 2.05573  [get_nets n77]
set_load -min 1.89611  [get_nets n77]
set_resistance 4.17403e-05  [get_nets n77]
set_load -max 19.9106  [get_nets n81]
set_load -min 18.3618  [get_nets n81]
set_resistance 0.000212274  [get_nets n81]
set_load -max 23.4794  [get_nets n82]
set_load -min 21.6516  [get_nets n82]
set_resistance 0.000256443  [get_nets n82]
set_load -max 9.42725  [get_nets n83]
set_load -min 8.6941  [get_nets n83]
set_resistance 0.000118847  [get_nets n83]
set_load -max 0.97583  [get_nets n84]
set_load -min 0.899995  [get_nets n84]
set_resistance 1.93376e-05  [get_nets n84]
set_load -max 20.2789  [get_nets n85]
set_load -min 18.6996  [get_nets n85]
set_resistance 0.000219225  [get_nets n85]
