#@ # 
#@ # Running icc2_shell Version T-2022.03-SP4 for linux64 -- Aug 31, 2022
#@ # Date:   Thu Feb 27 16:41:35 2025
#@ # Run by: AMuthuKKumar@mavenserver-RH3
#@ 

gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
####################### Welcome to MUTHUKKUMAR A Major Project ##########################

########################### MACRO Creation ###################

####################### Regular flow from RTL to GDSII #######################

################### source the file setup.tcl############################
source -echo ../scripts/setup.tcl

##########################create a design library ################################

Create_lib -technology $TECH_FILE -ref_libs $REFERENCE_LIBRARY Load_Unit.dlib
read_verilog ../Inputs/LU.v
link_block
win_set_filter -visible -class cell -filter {clock_margin hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class pseudo_bump -filter {deleted}
win_set_filter -visible -class pseudo_tsv -filter {deleted}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-82}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage block_shielding topology_node topology_edge topology_repeater annotation_shape core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {array clock_margin hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class pseudo_bump -filter {deleted}
win_set_filter -class pseudo_tsv -filter {deleted}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-82}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pseudo_tsv pin_blockage topology_node topology_edge topology_repeater annotation_shape edit_group shape via placement_blockage }
current_design
###################### RC parasitic model ##########################
 
read_parasitic_tech -layermap ../../../ref/tech/saed32nm_tf_itf_tluplus.map -tlup ../../../ref/tech/saed32nm_1p9m_Cmax.lv.nxtgrd -name maxTLU
read_parasitic_tech -layermap ../../../ref/tech/saed32nm_tf_itf_tluplus.map -tlup ../../../ref/tech/saed32nm_1p9m_Cmin.lv.nxtgrd -name minTLU
report_lib -parasitic_tech Load_Unit.dlib
create_clock -name clock -period 5 [get_ports clk_in]
get_site_defs
set_attribute [get_site_defs unit] symmetry Y
set_attribute [get_site_defs unit] is_default true

##################### Layer directions ############################

set_attribute [get_layers {M1 M3 M5 M7 M9}] routing_direction horizontal
set_attribute [get_layers {M2 M4 M6 M8}] routing_direction vertical
get_attribute [get_layers M?] routing_direction

report_ignored_layers
set_ignored_layers -max_routing_layer M6
report_ignored_layers

######################### UPF (unified power format)#############################
load_upf ../Inputs/LU.upf
commit_upf
check_mv_design
set corner default
set_process_number 0.99 -corner default
set_temperature 125 -corner default
set_voltage 0.95 -object_list VDD -corner default
set_voltage 0 -object_list VSS -corner default

current_mode
current_corner


set_scenario_status default -active true -setup true -hold true -max_transition true -max_capacitance true -min_capacitance true -leakage_power true  \
-dynamic_power true

report_scenarios
report_parasitic_parameters
set_parasitic_parameters -corners default -early_spec minTLU -late_spec maxTLU

report_pvt

########################### Floor planining #############################
initialize_floorplan -core_utilization 0.6 -side_ratio {0.8 0.8} -core_offset {3}
#initialize_floorplan -core_utilization 0.6 -coincident_boundary false -side_ratio {1 1}
place_pins -self
remove_pg_strategies -all
remove_pg_patterns -all
remove_pg_regions -all
remove_pg_via_master_rules -all
remove_pg_strategy_via_rules -all
remove_routes -net_types {power ground} -ring -stripe -macro_pin_connect -lib_cell_pin_connect

connect_pg_net

#################Creating the Ring ################
                    
create_pg_ring_pattern ring_pattern -horizontal_layer M5 -horizontal_width {1} -horizontal_spacing {0.3} -vertical_layer M6 -vertical_width {1} -vertical_spacing {0.3}

set_pg_strategy core_ring -pattern {{name: ring_pattern} {nets: {VDD VSS}} {offset: {0.3 0.3}}} -core -extension {{{side:1} {direction:B} {nets:VDD} {stop:design_boundary_and_generate_pin}}\
									{{side:2} {direction:L} {nets:VSS} {stop:design_boundary_and_generate_pin}}}

compile_pg -strategies core_ring

################# Creating the Mesh_pattern to the design#####################

create_pg_mesh_pattern mesh_pattern -layers {{{horizontal_layer: M5} {width: 0.16} {pitch:10} {spacing:interleaving} {offset:2}} {{vertical_layer: M6} {width: 0.26} {pitch:10} {spacing:interleaving} {offset: 2}}} 

set_pg_strategy M5M6_mesh -pattern {{name: mesh_pattern} {nets: VDD VSS}} -core -extension {{stop:first_target}}

compile_pg -strategies M5M6_mesh

##################lower mesh connection ##############################

create_pg_mesh_pattern low_mesh_pattern -layer {{vertical_layer: M2} {width: 0.096} {pitch:5} {spacing:interleaving} {offset:1} {trim:true}}

set_pg_strategy M2_low_mesh -pattern {{name:low_mesh_pattern} {nets: VDD VSS}} -core -extension {{stop:outermost_ring}}

compile_pg -strategies M2_low_mesh 
create_pg_std_cell_conn_pattern std_rail_conn1  -layers M1
#-rail_width 0.0325
set_pg_strategy std_rail_1 -pattern {{name : std_rail_conn1} {nets:VDD VSS}} -core

compile_pg -strategies std_rail_1
check_pg_drc
check_pg_missing_vias
check_pg_drc -ignore_std_cells
check_pg_connectivity -check_std_cell_pins non
report_timing
get_lib_cells -filter "function_id==a0.0"
get_lib_cells -filter "function_id==Ia0.0"
set_dont_touch [get_lib_cells */TIE*] false
set_lib_cell_purpose -include optimization [get_lib_cells */TIE*]

check_netlist
check_design -checks pre_placement_stage

#create_placement -floorplan 
place_opt
check_legality
report_qor -summary
report_power
report_constraints -all_violators
report_timing
set CTS_CELLS [get_lib_cells "*/NBUFF*LVT */NBUFF*RVT */INVX*_LVT */INVX*_RVT */CGL* */LSUP* */*DFF*"]
set_dont_touch $CTS_CELLS false
set_lib_cell_purpose -exclude cts [get_lib_cells] 
set_lib_cell_purpose -include cts $CTS_CELLS
source ../scripts/clock_ndr.tcl
source ../scripts/cts_include_refs.tcl
check_design -checks pre_clock_tree_stage
clock_opt
report_timing -delay_type max
check_design -checks pre_route_stage 

source ../../../ref/tech/saed32nm_ant_1p9m.tcl
report_app_options route.detail.*antenna*
route_auto
route_opt
route_eco
check_routes
report_qor
report_constraints -all_violators 
report_congestion
report_utilization 
check_lvs
check_pg_drc
check_pg_missing_vias
check_pg_connectivity
report_timing -delay_type max
report_timing -delay_type min 
gui_show_map -window [gui_get_current_window -types Layout -mru] -map {globalCongestionMap} -show {true}
gui_set_map_option -map {globalCongestionMap} -option {rule_level} -value {hard}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2 M3 M4 M5 M6}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2 M3 M4 M5 M6 M8 M9 MRDL}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2 M3 M4 M5 M6 M9 MRDL}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2 M3 M4 M5 M6 MRDL}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2 M3 M4 M5 M6}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2 M3}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2 M3 M4}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2 M3 M4 M5}
gui_set_map_option -map {globalCongestionMap} -option {layers} -value {M1 M2 M3 M4 M5 M6}
gui_show_map -window [gui_get_current_window -types Layout -mru] -map {globalCongestionMap} -show {false}
gui_show_map -window [gui_get_current_window -types Layout -mru] -map {globalCongestionMap} -show {false}
report_constraints -all_violators  > ../reports/all_violators
report_constraints -all_violators  > ../reports/all_violators
report_congestion > ../reports/congestion
report_utilization > ../reports/utilization
check_lvs > ../reports/lvs_rpt
report_timing -delay_type max > ../reports/setup_timing
report_timing -delay_type min > ../reports/hold_timing
write_gds ../results/LU.gds
save_block -as LU_comp
